# AnalyticalSurfaceCannotMoveByConnector Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..AnalyticalSurfaceCannotMoveByConnector Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Cannot move analytical surface because it will disconnect the analytical nodes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AnalyticalSurfaceCannotMoveByConnector { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalSurfaceCannotMoveByConnector As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AnalyticalSurfaceCannotMoveByConnector {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace